Revit 2026 API

# LightGroupManagerDeleteGroup Method

---

Remove the given LightGroup object from the set of LightGroup objects

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeleteGroup(
	ElementId groupId
)
```
```vb
Public Sub DeleteGroup (
	groupId As ElementId
)
```
```cpp
public:
void DeleteGroup(
	ElementId^ groupId
)
```
```fsharp
member DeleteGroup :
        groupId : ElementId -> unit
```

#### Parameters

groupId ElementId
     The Id of the LightGroup object to remove

| Exception | Condition |
| --- | --- |
| ArgumentException | The given element Id does not correspond to a light group -or- The LightGroup is not contained by this LightGroupManager |
| ArgumentNullException | A non-optional argument was null |

Note that only the group is deleted, not the lights contained in the group The lights will still exist but will not be in a group any longer

#### Reference

LightGroupManager Class

Autodesk.Revit.DB.Lighting Namespace